kurella-saikumar/eStar_InstrumentCluster/eStar_Cluster_Demo/STM32CubeIDE/Application/User/Core/DisplayInit.c
/** \addtogroup
 *  @{
 * @file DisplayInit.c
 * @file DisplayInit.h
 * @brief Template Source File
 *
 * File Short Name:
 *
 * Author:
 *
 * Create Date:
 *
 * Copyright:  All information contained herein is, and remains the property of
 * eSTAR TECHNOLOGIES(OPC) PRIVATE LIMITED and its suppliers, if any.
 * Dissemination of this information or reproduction of this material is strictly
 * forbidden unless prior written permission is obtained from
 * eSTAR TECHNOLOGIES(OPC) PRIVATE LIMITED
 **********************************************************************************************/

/**************************************************************************************************
 * Include Platform or Standard Headers
 ***************************************************************************************************/

/**************************************************************************************************
 * Include Project Specific Headers
 ***************************************************************************************************/

#include "DisplayInit.h"
#include "main.h"
#include "string.h"
#include "cmsis_os.h"
#include "libjpeg.h"
#include "app_touchgfx.h"
#include "InstrumentClusterInit.h"
#include "stm32h735g_discovery_ospi.h"
#include <touchgfx/hal/Config.hpp>
#include "eeprom_emul.h"

/**************************************************************************************************
 * DEFINE FILE SCOPE MACROS
 ***************************************************************************************************/

/**************************************************************************************************
 * DEFINE FILE SCOPE TYPES
 ***************************************************************************************************/

/**************************************************************************************************
 * DECLARE GLOBAL VARIABLES
 ***************************************************************************************************/



KEEP extern const unsigned char image_abs_detection1_const[];
KEEP extern const unsigned char image_abs_detection2_const[];
KEEP extern const unsigned char image_background_const[];
KEEP extern const unsigned char image_clustericons1_const[];
KEEP extern const unsigned char image_clustericons2_const[];
KEEP extern const unsigned char image_doorswarning1_const[];
KEEP extern const unsigned char image_doorswarning2_const[];
KEEP extern const unsigned char image_engineoil1_const[];
KEEP extern const unsigned char image_engineoil2_const[];
KEEP extern const unsigned char image_enginewarning_w_const[];
KEEP extern const unsigned char image_enginewarning_y_const[];
KEEP extern const unsigned char image_fuelbar01_const[];
KEEP extern const unsigned char image_fuelbar02_const[];
KEEP extern const unsigned char image_fuelbar03_const[];
KEEP extern const unsigned char image_fuelbar04_const[];
KEEP extern const unsigned char image_fuelbar05_const[];
KEEP extern const unsigned char image_fuelbar06_const[];
KEEP extern const unsigned char image_fuelbar07_const[];
KEEP extern const unsigned char image_fuelbar08_const[];
KEEP extern const unsigned char image_fuelbar09_const[];
KEEP extern const unsigned char image_fuelbar10_const[];
KEEP extern const unsigned char image_high_beam_const[];
KEEP extern const unsigned char image_high_beam_1_const[];
KEEP extern const unsigned char image_highbeam1_const[];
KEEP extern const unsigned char image_highbeam2_const[];
KEEP extern const unsigned char image_leftindicator1_const[];
KEEP extern const unsigned char image_leftindicator2_const[];
KEEP extern const unsigned char image_lowbattery1_const[];
KEEP extern const unsigned char image_lowbattery2_const[];
KEEP extern const unsigned char image_lowbeam1_const[];
KEEP extern const unsigned char image_lowbeam2_const[];
KEEP extern const unsigned char image_parking_r_const[];
KEEP extern const unsigned char image_parking_w_const[];
KEEP extern const unsigned char image_rightindicator1_const[];
KEEP extern const unsigned char image_rightindicator2_const[];
KEEP extern const unsigned char image_rpmbar01_const[];
KEEP extern const unsigned char image_rpmbar02_const[];
KEEP extern const unsigned char image_rpmbar03_const[];
KEEP extern const unsigned char image_rpmbar04_const[];
KEEP extern const unsigned char image_rpmbar05_const[];
KEEP extern const unsigned char image_rpmbar06_const[];
KEEP extern const unsigned char image_rpmbar07_const[];
KEEP extern const unsigned char image_rpmbar08_const[];
KEEP extern const unsigned char image_rpmbar09_const[];
KEEP extern const unsigned char image_rpmbar10_const[];
KEEP extern const unsigned char image_rpmicon1_const[];
KEEP extern const unsigned char image_rpmicon2_const[];
KEEP extern const unsigned char image_seatbelt_r_const[];
KEEP extern const unsigned char image_seatbelt_w_const[];
KEEP extern const unsigned char image_servicereminder_w_const[];
KEEP extern const unsigned char image_servicereminder_y_const[];
KEEP extern const unsigned char image_tempicon1_const[];
KEEP extern const unsigned char image_tempicon2_const[];

#if 1
extern unsigned char ucImage_abs_detection1_HypRAM[24*20];
extern unsigned char ucImage_abs_detection2_HypRAM[24*20];
extern unsigned char ucImage_background_HypRAM[480*272];
extern unsigned char ucImage_clustericons1_HypRAM[24*20];
extern unsigned char ucImage_clustericons2_HypRAM[24*20];
extern unsigned char ucImage_doorswarning1_HypRAM[24*20];
extern unsigned char ucImage_doorswarning2_HypRAM[24*20];
extern unsigned char ucImage_engineoil1_HypRAM[24*20];
extern unsigned char ucImage_engineoil2_HypRAM[24*20];
extern unsigned char ucImage_enginewarning_w_HypRAM[64*64];
extern unsigned char ucImage_enginewarning_y_HypRAM[64*64];
extern unsigned char ucImage_fuelbar01_HypRAM[128*128];
extern unsigned char ucImage_fuelbar02_HypRAM[128*128];
extern unsigned char ucImage_fuelbar03_HypRAM[128*128];
extern unsigned char ucImage_fuelbar04_HypRAM[128*128];
extern unsigned char ucImage_fuelbar05_HypRAM[128*128];
extern unsigned char ucImage_fuelbar06_HypRAM[128*128];
extern unsigned char ucImage_fuelbar07_HypRAM[128*128];
extern unsigned char ucImage_fuelbar08_HypRAM[128*128];
extern unsigned char ucImage_fuelbar09_HypRAM[128*128];
extern unsigned char ucImage_fuelbar10_HypRAM[128*128];
extern unsigned char ucImage_high_beam_HypRAM[64*64];
extern unsigned char ucImage_high_beam_1_HypRAM[50*50];
extern unsigned char ucImage_highbeam1_HypRAM[24*20];
extern unsigned char ucImage_highbeam2_HypRAM[24*20];
extern unsigned char ucImage_leftindicator1_HypRAM[24*20];
extern unsigned char ucImage_leftindicator2_HypRAM[24*20];
extern unsigned char ucImage_lowbattery1_HypRAM[24*20];
extern unsigned char ucImage_lowbattery2_HypRAM[24*20];
extern unsigned char ucImage_lowbeam1_HypRAM[24*20];
extern unsigned char ucImage_lowbeam2_HypRAM[24*20];
extern unsigned char ucImage_parking_r_HypRAM[64*64];
extern unsigned char ucImage_parking_w_HypRAM[64*64];
extern unsigned char ucImage_rightindicator1_HypRAM[24*20];
extern unsigned char ucImage_rightindicator2_HypRAM[24*20];
extern unsigned char ucImage_rpmbar01_HypRAM[128*128];
extern unsigned char ucImage_rpmbar02_HypRAM[128*128];
extern unsigned char ucImage_rpmbar03_HypRAM[128*128];
extern unsigned char ucImage_rpmbar04_HypRAM[128*128];
extern unsigned char ucImage_rpmbar05_HypRAM[128*128];
extern unsigned char ucImage_rpmbar06_HypRAM[128*128];
extern unsigned char ucImage_rpmbar07_HypRAM[128*128];
extern unsigned char ucImage_rpmbar08_HypRAM[128*128];
extern unsigned char ucImage_rpmbar09_HypRAM[128*128];
extern unsigned char ucImage_rpmbar10_HypRAM[128*128];
extern unsigned char ucImage_rpmicon1_HypRAM[24*20];
extern unsigned char ucImage_rpmicon2_HypRAM[24*20];
extern unsigned char ucImage_seatbelt_r_HypRAM[64*64];
extern unsigned char ucImage_seatbelt_w_HypRAM[64*64];
extern unsigned char ucImage_servicereminder_w_HypRAM[64*64];
extern unsigned char ucImage_servicereminder_y_HypRAM[64*64];
extern unsigned char ucImage_tempicon1_HypRAM[24*20];
extern unsigned char ucImage_tempicon2_HypRAM[24*20];

#endif


