kurella-saikumar/eStar_InstrumentCluster/eStar_Cluster_Demo/STM32CubeIDE/Application/User/Core/DisplayInit.c
void Disp_imgDataHyperRAM_Init(void)
{


	memset(ucImage_abs_detection1_HypRAM, 0 ,(24*20));
	memset(ucImage_abs_detection2_HypRAM, 0 ,(24*20));
	memset(ucImage_background_HypRAM, 0 ,(480*272));
	memset(ucImage_clustericons1_HypRAM, 0 ,(24*20));
	memset(ucImage_clustericons2_HypRAM, 0 ,(24*20));
	memset(ucImage_doorswarning1_HypRAM, 0 ,(24*20));
	memset(ucImage_doorswarning2_HypRAM, 0 ,(24*20));
	memset(ucImage_engineoil1_HypRAM, 0 ,(24*20));
	memset(ucImage_engineoil2_HypRAM, 0 ,(24*20));
	memset(ucImage_enginewarning_w_HypRAM, 0 ,(64*64));
	memset(ucImage_enginewarning_y_HypRAM, 0 ,(64*64));
	memset(ucImage_fuelbar01_HypRAM, 0 ,(128*128));
	memset(ucImage_fuelbar02_HypRAM, 0 ,(128*128));
	memset(ucImage_fuelbar03_HypRAM, 0 ,(128*128));
	memset(ucImage_fuelbar04_HypRAM, 0 ,(128*128));
	memset(ucImage_fuelbar05_HypRAM, 0 ,(128*128));
	memset(ucImage_fuelbar06_HypRAM, 0 ,(128*128));
	memset(ucImage_fuelbar07_HypRAM, 0 ,(128*128));
	memset(ucImage_fuelbar08_HypRAM, 0 ,(128*128));
	memset(ucImage_fuelbar09_HypRAM, 0 ,(128*128));
	memset(ucImage_fuelbar10_HypRAM, 0 ,(128*128));
	memset(ucImage_high_beam_HypRAM, 0 ,(64*64));
	memset(ucImage_high_beam_1_HypRAM, 0 ,(50*50));
	memset(ucImage_highbeam1_HypRAM, 0 ,(24*20));
	memset(ucImage_highbeam2_HypRAM, 0 ,(24*20));
	memset(ucImage_leftindicator1_HypRAM, 0 ,(24*20));
	memset(ucImage_leftindicator2_HypRAM, 0 ,(24*20));
	memset(ucImage_lowbattery1_HypRAM, 0 ,(24*20));
	memset(ucImage_lowbattery2_HypRAM, 0 ,(24*20));
	memset(ucImage_lowbeam1_HypRAM, 0 ,(24*20));
	memset(ucImage_lowbeam2_HypRAM, 0 ,(24*20));
	memset(ucImage_parking_r_HypRAM, 0 ,(64*64));
	memset(ucImage_parking_w_HypRAM, 0 ,(64*64));
	memset(ucImage_rightindicator1_HypRAM, 0 ,(24*20));
	memset(ucImage_rightindicator2_HypRAM, 0 ,(24*20));
	memset(ucImage_rpmbar01_HypRAM, 0 ,(128*128));
	memset(ucImage_rpmbar02_HypRAM, 0 ,(128*128));
	memset(ucImage_rpmbar03_HypRAM, 0 ,(128*128));
	memset(ucImage_rpmbar04_HypRAM, 0 ,(128*128));
	memset(ucImage_rpmbar05_HypRAM, 0 ,(128*128));
	memset(ucImage_rpmbar06_HypRAM, 0 ,(128*128));
	memset(ucImage_rpmbar07_HypRAM, 0 ,(128*128));
	memset(ucImage_rpmbar08_HypRAM, 0 ,(128*128));
	memset(ucImage_rpmbar09_HypRAM, 0 ,(128*128));
	memset(ucImage_rpmbar10_HypRAM, 0 ,(128*128));
	memset(ucImage_rpmicon1_HypRAM, 0 ,(24*20));
	memset(ucImage_rpmicon2_HypRAM, 0 ,(24*20));
	memset(ucImage_seatbelt_r_HypRAM, 0 ,(64*64));
	memset(ucImage_seatbelt_w_HypRAM, 0 ,(64*64));
	memset(ucImage_servicereminder_w_HypRAM, 0 ,(64*64));
	memset(ucImage_servicereminder_y_HypRAM, 0 ,(64*64));
	memset(ucImage_tempicon1_HypRAM, 0 ,(24*20));
	memset(ucImage_tempicon2_HypRAM, 0 ,(24*20));

#if 1
	uint32_t Address1= (uint32_t )(&image_abs_detection1_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_abs_detection1_HypRAM,Address1,(24*20*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-1\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success1\n\r");
#endif
	}

	uint32_t Address2= (uint32_t )(&image_abs_detection2_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_abs_detection2_HypRAM,Address2,(24*20*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-2\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success2\n\r");
#endif
	}

	uint32_t Address3= (uint32_t )(&image_background_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_background_HypRAM,Address3,(480*272*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-3\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success3\n\r");
#endif
	}

	uint32_t Address4= (uint32_t )(&image_clustericons1_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_clustericons1_HypRAM,Address4,(24*20*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-4\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success4\n\r");
#endif
	}

	uint32_t Address5= (uint32_t )(&image_clustericons2_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_clustericons2_HypRAM,Address5,(24*20*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-5\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success5\n\r");
#endif
	}

	uint32_t Address6= (uint32_t )(&image_doorswarning1_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_doorswarning1_HypRAM,Address6,(24*20*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-6\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success6\n\r");
#endif
	}

	uint32_t Address7= (uint32_t )(&image_doorswarning2_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_doorswarning2_HypRAM,Address7,(24*20*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-7\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success7\n\r");
#endif
	}

	uint32_t Address8= (uint32_t )(&image_engineoil1_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_engineoil1_HypRAM,Address8,(24*20*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-8\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success8\n\r");
#endif
	}

	uint32_t Address9= (uint32_t )(&image_engineoil2_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_engineoil2_HypRAM,Address9,(24*20*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-9\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success9\n\r");
#endif
	}

	uint32_t Address10= (uint32_t )(&image_enginewarning_w_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_enginewarning_w_HypRAM,Address10,(64*64*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-10\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success10\n\r");
#endif
	}

	uint32_t Address11= (uint32_t )(&image_enginewarning_y_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_enginewarning_y_HypRAM,Address11,(64*64*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-11\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success11\n\r");
#endif
	}


	uint32_t Address12= (uint32_t )(&image_fuelbar01_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_fuelbar01_HypRAM,Address12,(128*128*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-12\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success12\n\r");
#endif
	}
	uint32_t Address13= (uint32_t )(&image_fuelbar02_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_fuelbar02_HypRAM,Address13,(128*128*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-13\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success13\n\r");
#endif
	}
	uint32_t Address14= (uint32_t )(&image_fuelbar03_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_fuelbar03_HypRAM,Address14,(128*128*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-14\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success14\n\r");
#endif
	}

	uint32_t Address15= (uint32_t )(&image_fuelbar04_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_fuelbar04_HypRAM,Address15,(128*128*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-15\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success15\n\r");
#endif
	}

	uint32_t Address16= (uint32_t )(&image_fuelbar05_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_fuelbar05_HypRAM,Address16,(128*128*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-16\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success16\n\r");
#endif
	}

