kurella-saikumar/eStar_InstrumentCluster/eStar_Cluster_Demo/STM32CubeIDE/Application/User/Core/DisplayInit.c
	uint32_t Address17= (uint32_t )(&image_fuelbar06_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_fuelbar06_HypRAM,Address17,(128*128*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-17\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success17\n\r");
#endif
	}

	uint32_t Address18= (uint32_t )(&image_fuelbar07_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_fuelbar07_HypRAM,Address18,(128*128*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-18\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success18\n\r");
#endif
	}

	uint32_t Address19= (uint32_t )(&image_fuelbar08_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_fuelbar08_HypRAM,Address19,(128*128*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-19\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success19\n\r");
#endif
	}

	uint32_t Address20= (uint32_t )(&image_fuelbar09_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_fuelbar09_HypRAM,Address20,(128*128*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-20\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success20\n\r");
#endif
	}

	uint32_t Address21= (uint32_t )(&image_fuelbar10_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_fuelbar10_HypRAM,Address21,(128*128*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-21\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success21\n\r");
#endif
	}

	uint32_t Address22= (uint32_t )(&image_high_beam_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_high_beam_HypRAM,Address22,(64*64*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-22\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success22\n\r");
#endif
	}

	uint32_t Address23= (uint32_t )(&image_high_beam_1_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_high_beam_1_HypRAM,Address23,(50*50*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-23\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success23\n\r");
#endif
	}

	uint32_t Address24= (uint32_t )(&image_highbeam1_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_highbeam1_HypRAM,Address24,(24*20*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-24\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success24\n\r");
#endif
	}

	uint32_t Address25= (uint32_t )(&image_highbeam2_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_highbeam2_HypRAM,Address25,(24*20*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-25\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success25\n\r");
#endif
	}


	uint32_t Address26= (uint32_t )(&image_leftindicator1_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_leftindicator1_HypRAM,Address26,(24*20*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-26\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success26\n\r");
#endif
	}

	uint32_t Address27= (uint32_t )(&image_leftindicator2_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_leftindicator2_HypRAM,Address27,(24*20*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-27\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success27\n\r");
#endif
	}

	uint32_t Address28= (uint32_t )(&image_lowbattery1_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_lowbattery1_HypRAM,Address28,(24*20*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-28\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success28\n\r");
#endif
	}

	uint32_t Address29= (uint32_t )(&image_lowbattery2_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_lowbattery2_HypRAM,Address29,(24*20*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-29\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success29\n\r");
#endif
	}

	uint32_t Address30= (uint32_t )(&image_lowbeam1_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_lowbeam1_HypRAM,Address30,(24*20*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-30\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success30\n\r");
#endif
	}

	uint32_t Address31= (uint32_t )(&image_lowbeam2_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_lowbeam2_HypRAM,Address31,(24*20*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-31\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success31\n\r");
#endif
	}

	uint32_t Address32= (uint32_t )(&image_parking_r_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_parking_r_HypRAM,Address32,(64*64*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-32\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success32\n\r");
#endif
	}

	uint32_t Address33= (uint32_t )(&image_parking_w_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_parking_w_HypRAM,Address33,(64*64*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-33\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success33\n\r");
#endif
	}

	uint32_t Address34= (uint32_t )(&image_rightindicator1_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_rightindicator1_HypRAM,Address34,(24*20*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-34\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success34\n\r");
#endif
	}

	uint32_t Address35= (uint32_t )(&image_rightindicator2_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_rightindicator2_HypRAM,Address35,(24*20*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-35\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success35\n\r");
#endif
	}


	uint32_t Address36= (uint32_t )(&image_rpmbar01_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_rpmbar01_HypRAM,Address36,(128*128*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-36\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success36\n\r");
#endif
	}

	uint32_t Address37= (uint32_t )(&image_rpmbar02_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_rpmbar02_HypRAM,Address37,(128*128*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-37\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success37\n\r");
#endif
	}

	uint32_t Address38= (uint32_t )(&image_rpmbar03_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_rpmbar03_HypRAM,Address38,(128*128*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-38\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success38\n\r");
#endif
	}

	uint32_t Address39= (uint32_t )(&image_rpmbar04_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_rpmbar04_HypRAM,Address39,(128*128*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-39\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success39\n\r");
#endif
	}

	uint32_t Address40= (uint32_t )(&image_rpmbar05_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_rpmbar05_HypRAM,Address40,(128*128*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-40\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success40\n\r");
#endif
	}

	uint32_t Address41= (uint32_t )(&image_rpmbar06_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_rpmbar06_HypRAM,Address41,(128*128*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-41\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success41\n\r");
#endif
	}

