kurella-saikumar/eStar_InstrumentCluster/eStar_Cluster_Demo/STM32CubeIDE/Application/User/Core/DisplayInit.c
	uint32_t Address42= (uint32_t )(&image_rpmbar07_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_rpmbar07_HypRAM,Address42,(128*128*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-42\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success42\n\r");
#endif
	}

	uint32_t Address43= (uint32_t )(&image_rpmbar08_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_rpmbar08_HypRAM,Address43,(128*128*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-43\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success43\n\r");
#endif
	}

	uint32_t Address44= (uint32_t )(&image_rpmbar09_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_rpmbar09_HypRAM,Address44,(128*128*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-44\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success44\n\r");
#endif
	}


	uint32_t Address45= (uint32_t )(&image_rpmbar10_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_rpmbar10_HypRAM,Address45,(128*128*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-45\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success45\n\r");
#endif
	}

	uint32_t Address46= (uint32_t )(&image_rpmicon1_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_rpmicon1_HypRAM,Address46,(24*20*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-46\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success46\n\r");
#endif
	}

	uint32_t Address47= (uint32_t )(&image_rpmicon2_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_rpmicon2_HypRAM,Address47,(24*20*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-47\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success47\n\r");
#endif
	}


	uint32_t Address48= (uint32_t )(&image_seatbelt_r_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_seatbelt_r_HypRAM,Address48,(64*64*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-48\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success48\n\r");
#endif
	}

	uint32_t Address49= (uint32_t )(&image_seatbelt_w_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_seatbelt_w_HypRAM,Address49,(64*64*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-49\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success49\n\r");
#endif
	}

	uint32_t Address50= (uint32_t )(&image_servicereminder_w_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_servicereminder_w_HypRAM,Address50,(64*64*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-50\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success50\n\r");
#endif
	}

	uint32_t Address51= (uint32_t )(&image_servicereminder_y_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_servicereminder_y_HypRAM,Address51,(64*64*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-51\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success51\n\r");
#endif
	}

	uint32_t Address52= (uint32_t )(&image_tempicon1_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_tempicon1_HypRAM,Address52,(24*20*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-52\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success52\n\r");
#endif
	}

	uint32_t Address53= (uint32_t )(&image_tempicon2_const[0] - FLASH_BASE_ADDR);
	if(BSP_OSPI_NOR_Read(BSP_INSTANCE,ucImage_tempicon2_HypRAM,Address53,(24*20*4)))
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Fail-53\n\r");
#endif
	}
	else
	{
#if(DBGPrints_TestMacro == 1)
		printf("Copy Success53\n\r");
#endif
	}
#endif

}




